InformationRegisters/РСК_СообщенияСМС.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.13">
	<InformationRegister>
		<Properties>
			<Name>РСК_СообщенияСМС</Name>
			<Comment>РС Консалт, Трофимов Евгений №19208, 25.07.2022 г.</Comment>
			<InformationRegisterPeriodicity>Second</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ТекстСМС</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>600</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Отправлено</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>IDSms</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КодСтатуса</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.РСК_КодыСтатусовОтправкиСМС</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Баланс</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Получатель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Партнеры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>НомерТелефона</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>15</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/РСК_ТелефоныДляРассылкиСМС.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.15">
	<InformationRegister>
		<Properties>
			<Name>РСК_ТелефоныДляРассылкиСМС</Name>
			<Comment>РС Консалт: Трофимов Евгений 05.11.2022 Задача 21666</Comment>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Dimension>
				<Properties>
					<Name>Партнер</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Партнеры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>НомерТелефона</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>11</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/РСК_СообщенияСМС/Forms/ФормаГрупповойОтправкиСМССообщений/Ext/Form/Module.bsl
&НаСервере
//++ РС Консалт: Трофимов Евгений 25.07.2022 Задача 19208
//e1cib/data/Документ.Задание?ref=b240f4f00342a1014b20d05d81910626
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Если Параметры.Свойство("ДокументОснование") Тогда
		ОбновитьСписокНаСервере(Параметры.ДокументОснование);	
	ИначеЕсли Параметры.Свойство("МассивАктов") Тогда
		ОбработкаЗаполненияНаОснованииАктов(Параметры.МассивАктов);	
	ИначеЕсли Параметры.Свойство("Партнер") Тогда
		ОбработкаЗаполненияНаОснованииПартнера(Параметры.Партнер, Отказ);	
	Иначе
		ВызватьИсключение "Не указаны обязательные параметры открытия формы!";
	КонецЕсли;
	Отправитель = "Reamed";
КонецПроцедуры

&НаСервере
//++ РС Консалт: Трофимов Евгений 25.07.2022 Задача 19208
//e1cib/data/Документ.Задание?ref=b240f4f00342a1014b20d05d81910626
Процедура ОбработкаЗаполненияНаОснованииАктов(МассивАктов)
	
	Запрос = Новый Запрос;
	//++ РС Консалт: Трофимов Евгений 05.11.2022 Задача 21666
	//e1cib/data/Документ.Задание?ref=9c32d5284cfd59a04da1fbac6171ed0a
	//Было:
	//Запрос.Текст = 
	//"ВЫБРАТЬ
	//|	ПоручениеЭкспедитору.Пункт КАК Получатель,
	//|	МАКСИМУМ(ПартнерыКонтактнаяИнформация.Представление) КАК НомерТелефона
	//|ИЗ
	//|	Документ.ПоручениеЭкспедитору КАК ПоручениеЭкспедитору
	//|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Партнеры.КонтактнаяИнформация КАК ПартнерыКонтактнаяИнформация
	//|		ПО ПоручениеЭкспедитору.Пункт = ПартнерыКонтактнаяИнформация.Ссылка
	//|			И (ПартнерыКонтактнаяИнформация.Вид = ЗНАЧЕНИЕ(Справочник.ВидыКонтактнойИнформации.ТелефонПартнера))
	//|ГДЕ
	//|	ПоручениеЭкспедитору.Ссылка В(&МассивАктов)
	//|
	//|СГРУППИРОВАТЬ ПО
	//|	ПоручениеЭкспедитору.Пункт";
	//Запрос.УстановитьПараметр("МассивАктов", МассивАктов);	
	//РезультатЗапроса = Запрос.Выполнить();
	//
	//ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	//
	//Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
	//	НоваяСтрокаТЧ = ТаблицаПолучателей.Добавить();
	//	НоваяСтрокаТЧ.Получатель = ВыборкаДетальныеЗаписи.Получатель;
	//	НоваяСтрокаТЧ.НомерТелефона = НормализоватьНомерТелефона(ВыборкаДетальныеЗаписи.НомерТелефона);
	//КонецЦикла;
	
	//Стало:
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ПоручениеЭкспедитору.Пункт КАК Получатель,
	|	РСК_ТелефоныДляРассылкиСМС.НомерТелефона КАК НомерТелефона
	|ИЗ
	|	Документ.ПоручениеЭкспедитору КАК ПоручениеЭкспедитору
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.РСК_ТелефоныДляРассылкиСМС КАК РСК_ТелефоныДляРассылкиСМС
	|		ПО ПоручениеЭкспедитору.Пункт = РСК_ТелефоныДляРассылкиСМС.Партнер
	|ГДЕ
	|	ПоручениеЭкспедитору.Ссылка В(&МассивАктов)
	|
	|УПОРЯДОЧИТЬ ПО
	|	Получатель
	|АВТОУПОРЯДОЧИВАНИЕ";
	Запрос.УстановитьПараметр("МассивАктов", МассивАктов);	
	ТаблицаПолучателей.Загрузить(Запрос.Выполнить().Выгрузить());
	//-- КонецЗадачи 21666		

КонецПроцедуры

&НаСервере
//++ РС Консалт: Трофимов Евгений 25.07.2022 Задача 19208
//e1cib/data/Документ.Задание?ref=b240f4f00342a1014b20d05d81910626
Процедура ОбновитьСписокНаСервере(ЗагрузочнаяВедомость = Неопределено) 
	ЗагрузочнаяВедомостьДляЗапроса = Неопределено;
	Если ЗагрузочнаяВедомость = Неопределено И ЗначениеЗаполнено(ДокументОтборЗагрузочнаяВедомость) Тогда 
		ЗагрузочнаяВедомостьДляЗапроса = ДокументОтборЗагрузочнаяВедомость
	Иначе
		ЗагрузочнаяВедомостьДляЗапроса =  ЗагрузочнаяВедомость;
	КонецЕсли;
	Если ЗначениеЗаполнено(ЗагрузочнаяВедомостьДляЗапроса) Тогда
		//++ РС Консалт: Трофимов Евгений 05.11.2022 Задача 21666
		//e1cib/data/Документ.Задание?ref=9c32d5284cfd59a04da1fbac6171ed0a
		//Было:
		//ТаблицаПолучателей.Очистить();
		//Запрос = Новый Запрос;
		//Запрос.Текст = 
		//"ВЫБРАТЬ
		//|	ПоручениеЭкспедитору.Пункт КАК Получатель,
		//|	МАКСИМУМ(ПартнерыКонтактнаяИнформация.Представление) КАК НомерТелефона
		//|ИЗ
		//|	Документ.ЗаданиеНаПеревозку.Распоряжения КАК ЗаданиеНаПеревозкуРаспоряжения
		//|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ПоручениеЭкспедитору КАК ПоручениеЭкспедитору
		//|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Партнеры.КонтактнаяИнформация КАК ПартнерыКонтактнаяИнформация
		//|			ПО ПоручениеЭкспедитору.Пункт = ПартнерыКонтактнаяИнформация.Ссылка
		//|				И (ПартнерыКонтактнаяИнформация.Вид = ЗНАЧЕНИЕ(Справочник.ВидыКонтактнойИнформации.ТелефонПартнера))
		//|		ПО ЗаданиеНаПеревозкуРаспоряжения.Распоряжение = ПоручениеЭкспедитору.Ссылка
		//|ГДЕ
		//|	ЗаданиеНаПеревозкуРаспоряжения.Ссылка = &Ссылка
		//|
		//|СГРУППИРОВАТЬ ПО
		//|	ПоручениеЭкспедитору.Пункт";
		
		//Стало:
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	ПоручениеЭкспедитору.Пункт КАК Получатель,
		|	РСК_ТелефоныДляРассылкиСМС.НомерТелефона КАК НомерТелефона,
		|	ИСТИНА КАК Выбран
		|ИЗ
		|	Документ.ЗаданиеНаПеревозку.Распоряжения КАК ЗаданиеНаПеревозкуРаспоряжения
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ПоручениеЭкспедитору КАК ПоручениеЭкспедитору
		|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.РСК_ТелефоныДляРассылкиСМС КАК РСК_ТелефоныДляРассылкиСМС
		|			ПО ПоручениеЭкспедитору.Пункт = РСК_ТелефоныДляРассылкиСМС.Партнер
		|		ПО ЗаданиеНаПеревозкуРаспоряжения.Распоряжение = ПоручениеЭкспедитору.Ссылка
		|ГДЕ
		|	ЗаданиеНаПеревозкуРаспоряжения.Ссылка = &Ссылка
		|
		|УПОРЯДОЧИТЬ ПО
		|	Получатель
		|АВТОУПОРЯДОЧИВАНИЕ";
		//-- КонецЗадачи 21666		

		Запрос.УстановитьПараметр("Ссылка", ЗагрузочнаяВедомостьДляЗапроса);
		
		//++ РС Консалт: Трофимов Евгений 05.11.2022 Задача 21666
		//e1cib/data/Документ.Задание?ref=9c32d5284cfd59a04da1fbac6171ed0a
		//Было:
		//РезультатЗапроса = Запрос.Выполнить();
		//
		//ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
		//
		//Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		//	НоваяСтрокаТЧ = ТаблицаПолучателей.Добавить();
		//	НоваяСтрокаТЧ.Получатель = ВыборкаДетальныеЗаписи.Получатель;
		//	НоваяСтрокаТЧ.НомерТелефона = НормализоватьНомерТелефона(ВыборкаДетальныеЗаписи.НомерТелефона);
		//КонецЦикла;
		
		//Стало:
		ТаблицаПолучателей.Загрузить(Запрос.Выполнить().Выгрузить());
		//-- КонецЗадачи 21666		
	Иначе
		//++ РС Консалт: Трофимов Евгений 05.11.2022 Задача 21666
		//e1cib/data/Документ.Задание?ref=9c32d5284cfd59a04da1fbac6171ed0a
		//Было:
		//Для Каждого Строка ИЗ ТаблицаПолучателей Цикл
		//	Строка.НомерТелефона = НормализоватьНомерТелефона(ПолучитьНомерПолучателя(Строка.Получатель));
		//КонецЦикла;
		
		//Стало:
		Запрос = Новый Запрос;
		Запрос.Текст = 
			"ВЫБРАТЬ
			|	РСК_ТелефоныДляРассылкиСМС.Партнер КАК Получатель,
			|	РСК_ТелефоныДляРассылкиСМС.НомерТелефона КАК НомерТелефона,
			|	ИСТИНА КАК Выбран
			|ИЗ
			|	РегистрСведений.РСК_ТелефоныДляРассылкиСМС КАК РСК_ТелефоныДляРассылкиСМС
			|ГДЕ
			|	РСК_ТелефоныДляРассылкиСМС.Партнер В(&Получатели)
			|
			|УПОРЯДОЧИТЬ ПО
			|	Получатель
			|АВТОУПОРЯДОЧИВАНИЕ";
		
		Запрос.УстановитьПараметр("Получатели", ТаблицаПолучателей.Выгрузить().ВыгрузитьКолонку("Получатель"));
		ТаблицаПолучателей.Загрузить(Запрос.Выполнить().Выгрузить());
		//-- КонецЗадачи 21666		
	КонецЕсли;	
КонецПроцедуры

&НаСервере
Процедура ОбработкаЗаполненияНаОснованииПартнера(Партнер, Отказ)
	//++ РС Консалт: Трофимов Евгений 17.11.2022 Тикет 21931
	//e1cib/data/Документ.Задание?ref=b2c4a495b7eb77d044112200679ed904
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	РСК_ТелефоныДляРассылкиСМС.Партнер КАК Получатель,
		|	РСК_ТелефоныДляРассылкиСМС.НомерТелефона КАК НомерТелефона
		|ИЗ
		|	РегистрСведений.РСК_ТелефоныДляРассылкиСМС КАК РСК_ТелефоныДляРассылкиСМС
		|ГДЕ
		|	РСК_ТелефоныДляРассылкиСМС.Партнер = &Партнер";
	
	Запрос.УстановитьПараметр("Партнер", Партнер);
	
	РезультатЗапроса = Запрос.Выполнить();
	Если РезультатЗапроса.Пустой() Тогда
		ОбщегоНазначения.СообщитьПользователю(
			"Нет выбранных номеров для отправки СМС",,,,
			Отказ
		);
		Возврат;
	КонецЕсли;
	ТаблицаПолучателей.Загрузить(РезультатЗапроса.Выгрузить());
	//-- КонецТикета 21931		
КонецПроцедуры // ОбработкаЗаполненияНаОснованииПартнера()


&НаСервереБезКонтекста
//++ РС Консалт: Трофимов Евгений 25.07.2022 Задача 19208
//e1cib/data/Документ.Задание?ref=b240f4f00342a1014b20d05d81910626
Функция ПолучитьНомерПолучателя(Получатель)
	
	Возврат УправлениеКонтактнойИнформацией.КонтактнаяИнформацияОбъекта(
				Получатель,
				Справочники.ВидыКонтактнойИнформации.ТелефонПартнера,
				ТекущаяДатаСеанса()
			);	
	
КонецФункции

&НаКлиенте
//++ РС Консалт: Трофимов Евгений 25.07.2022 Задача 19208
//e1cib/data/Документ.Задание?ref=b240f4f00342a1014b20d05d81910626
Процедура ШаблонСМСПриИзменении(Элемент)	
	ТекстСМС = РСК_ВызовСервера.ЗначениеРеквизитаОбъекта(ШаблонСМС, "ТекстШаблонаSMS");
	ТекстСМС = УдалитьСимволыПереноса(ТекстСМС);
	ТекстСМС = СокрЛП(ТекстСМС);
	
	Пока Найти(ТекстСМС, "  ") > 0 Цикл
		ТекстСМС = СтрЗаменить(ТекстСМС, "  ", " ");
	КонецЦикла;
КонецПроцедуры

&НаКлиенте
//++ РС Консалт: Трофимов Евгений 25.07.2022 Задача 19208
//e1cib/data/Документ.Задание?ref=b240f4f00342a1014b20d05d81910626
Функция УдалитьСимволыПереноса (Строка)
	Количество = СтрЧислоСтрок(Строка);
	Стр ="";
	Если Количество > 1 Тогда
		Для Инд=0 по Количество Цикл
			Стр = Стр + СтрПолучитьСтроку(Строка,Инд)+" ";    
		КонецЦикла;
		Возврат СокрЛП(Стр);
	Иначе
		Возврат Строка
	КонецЕсли;
КонецФункции

//++ РС Консалт: Трофимов Евгений 25.07.2022 Задача 19208
//e1cib/data/Документ.Задание?ref=b240f4f00342a1014b20d05d81910626
&НаКлиенте
Процедура ВыделитьВсё(Команда)
	Для Каждого Строка Из ТаблицаПолучателей Цикл
		Строка.Выбран = Истина;
	КонецЦикла;
КонецПроцедуры

//++ РС Консалт: Трофимов Евгений 25.07.2022 Задача 19208
//e1cib/data/Документ.Задание?ref=b240f4f00342a1014b20d05d81910626
&НаКлиенте
Процедура СнятьВыделение(Команда)
	Для Каждого Строка Из ТаблицаПолучателей Цикл
		Строка.Выбран = Ложь;
	КонецЦикла;
КонецПроцедуры

//++ РС Консалт: Трофимов Евгений 25.07.2022 Задача 19208
//e1cib/data/Документ.Задание?ref=b240f4f00342a1014b20d05d81910626
&НаКлиенте
Процедура ОтправительНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	СписокОтправителей = Новый СписокЗначений;
	СписокОтправителей.Добавить("Reamed");
	СписокОтправителей.Добавить("ORTONICA.RU");
	ДанныеВыбора = СписокОтправителей;
КонецПроцедуры

//++ РС Консалт: Трофимов Евгений 25.07.2022 Задача 19208
//e1cib/data/Документ.Задание?ref=b240f4f00342a1014b20d05d81910626
&НаКлиенте
Процедура ОтправительПриИзменении(Элемент)
	Если Отправитель <> "Reamed" И Отправитель<>"ORTONICA.RU"  Тогда
		Отправитель = "";
	КонецЕсли;
КонецПроцедуры

//++ РС Консалт: Трофимов Евгений 25.07.2022 Задача 19208
//e1cib/data/Документ.Задание?ref=b240f4f00342a1014b20d05d81910626
&НаКлиенте
Процедура ОбновитьСписок(Команда)
	ОбновитьСписокНаСервере();
КонецПроцедуры

//++ РС Консалт: Трофимов Евгений 25.07.2022 Задача 19208
//e1cib/data/Документ.Задание?ref=b240f4f00342a1014b20d05d81910626
&НаКлиенте
Процедура ОтправитьСообщения(Команда)
	
	ВыбранныеСтроки = ТаблицаПолучателей.НайтиСтроки(Новый Структура("Выбран", Истина));
	Если ВыбранныеСтроки.Количество() = 0 Тогда
		ПоказатьПредупреждение(, "Не выбрано ни одного получателя!");
		Возврат;
	КонецЕсли;
	
	Счётчик = 0;
	Для Каждого Стр Из ВыбранныеСтроки Цикл
		ОбработкаПрерыванияПользователя();
		Счётчик = Счётчик + 1;
		Состояние(""+Счётчик+" из "+ВыбранныеСтроки.Количество(), Счётчик * 100 / ВыбранныеСтроки.Количество());
		Стр.СМСОтправлено = ОтправитьСообщениеСервер(Стр.НомерТелефона, ТекстСМС, Отправитель, Стр.Получатель);
	КонецЦикла;
	
КонецПроцедуры

//++ РС Консалт: Трофимов Евгений 25.07.2022 Задача 19208
//e1cib/data/Документ.Задание?ref=b240f4f00342a1014b20d05d81910626
&НаСервереБезКонтекста
Функция ОтправитьСообщениеСервер(НомерТелефона, ТекстСМС, Отправитель, Получатель)
	Возврат РегистрыСведений.РСК_СообщенияСМС.ОтправитьСМС(НомерТелефона, ТекстСМС, Отправитель, Получатель);
КонецФункции

//++ РС Консалт: Трофимов Евгений 25.07.2022 Задача 19208
//e1cib/data/Документ.Задание?ref=b240f4f00342a1014b20d05d81910626
&НаКлиенте
Процедура ТаблицаПолучателейПолучательПриИзменении(Элемент);
	ТД = Элементы.ТаблицаПолучателей.ТекущиеДанные;
	Если ТД = Неопределено Тогда
		Возврат;
	КонецЕсли;
	Если ЗначениеЗаполнено(ТД.Получатель) Тогда
		ТД.НомерТелефона = ПолучитьНомерПолучателя(ТД.Получатель);
	Иначе
		ТД.НомерТелефона = "";
	КонецЕсли;
КонецПроцедуры


//++ РС Консалт: Трофимов Евгений 25.07.2022 Задача 19208
//e1cib/data/Документ.Задание?ref=b240f4f00342a1014b20d05d81910626
&НаКлиенте
Процедура ТекстСМСПриИзменении(Элемент)	
	ТекстСМС = УдалитьСимволыПереноса(ТекстСМС);
	ТекстСМС = СокрЛП(ТекстСМС);
	
	Пока Найти(ТекстСМС, "  ") > 0 Цикл
		ТекстСМС = СтрЗаменить(ТекстСМС, "  ", " ");
	КонецЦикла;

КонецПроцедуры
